backend/app/controllers/daycares_controller.rb

  def index
    @daycares = Daycare.all
---
SELECT "daycares".* FROM "daycares" WHERE (undefined) LIMIT ?  [["LIMIT", 1]]