backend/app/controllers/toddlers_controller.rb

SELECT "toddlers".* FROM "toddlers"
---
  def index
    @toddlers = Toddler.all

INSERT INTO "toddlers" ("name", "birthday", "contact", "phone", "allergy", "daycare_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # byebug
    # @daycare = Daycare.find_by(params[:daycare_id])
    @toddler = @daycare.toddlers.new(toddler_params)

    if @toddler.save

SELECT "toddlers".* FROM "toddlers" WHERE "toddlers"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
DELETE FROM "toddlers" WHERE "toddlers"."id" = ?  [["id", 55]]
---
  def destroy
    @toddler = Toddler.find(params[:id])

    # byebug
    @toddler.destroy

SELECT "toddlers".* FROM "toddlers" WHERE "toddlers"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
---
    def set_toddler
      @toddler = Toddler.find(params[:id])

SELECT "daycares".* FROM "daycares" WHERE (undefined) LIMIT ?  [["LIMIT", 1]]
---
    def set_daycare
      @daycare = Daycare.find_by(params[:daycare_id])